In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
#np.nan: Not a number

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
# pd의 데이터 유형 중 기초: Series
type(s)

pandas.core.series.Series

In [8]:
#날짜형 데이터 data_range
#시작점 지정 후 6일 간 옵션
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
# DataFrame 생성(np.random.randn 통해 6행 4열 변수 생성 / column 및 row index 설정)
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = ['a', 'b', 'c', 'd'])

In [12]:
df

                   a         b         c         d
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133
2013-01-02  1.685949  0.014119 -1.754792  0.917461
2013-01-03  0.475382  0.722462  0.614499  0.503905
2013-01-04 -0.923146 -0.639620  0.272507  0.277208
2013-01-05  0.708669 -1.689697  0.662005 -0.641107
2013-01-06 -0.637289  0.037247  0.987588  1.645440

In [13]:
 df.head()

                   a         b         c         d
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133
2013-01-02  1.685949  0.014119 -1.754792  0.917461
2013-01-03  0.475382  0.722462  0.614499  0.503905
2013-01-04 -0.923146 -0.639620  0.272507  0.277208
2013-01-05  0.708669 -1.689697  0.662005 -0.641107

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df.columns
#in R: colnames(df)
#rownames(df)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [20]:
type(df)
#in R: class(df)

pandas.core.frame.DataFrame

In [22]:
df.describe()
#in R: summary(df)

              a         b         c         d
count  6.000000  6.000000  6.000000  6.000000
mean   0.241110 -0.600798 -0.243862  0.204962
std    0.948573  1.079037  1.387650  1.114365
min   -0.923146 -2.049297 -2.244977 -1.473133
25%   -0.443693 -1.427178 -1.247967 -0.411528
50%    0.306240 -0.312750  0.443503  0.390556
75%    0.650347  0.031465  0.650128  0.814072
max    1.685949  0.722462  0.987588  1.645440

In [23]:
df.describe

<bound method NDFrame.describe of                    a         b         c         d
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133
2013-01-02  1.685949  0.014119 -1.754792  0.917461
2013-01-03  0.475382  0.722462  0.614499  0.503905
2013-01-04 -0.923146 -0.639620  0.272507  0.277208
2013-01-05  0.708669 -1.689697  0.662005 -0.641107
2013-01-06 -0.637289  0.037247  0.987588  1.645440>

In [24]:
#안의 내용물들
df.values

array([[ 0.13709769, -2.04929724, -2.24497743, -1.47313319],
       [ 1.6859486 ,  0.01411918, -1.75479233,  0.91746076],
       [ 0.47538151,  0.72246214,  0.61449935,  0.50390459],
       [-0.92314596, -0.63961981,  0.27250709,  0.27720804],
       [ 0.70866911, -1.68969679,  0.66200486, -0.64110685],
       [-0.63728942,  0.03724708,  0.98758764,  1.64543957]])

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
a    6 non-null float64
b    6 non-null float64
c    6 non-null float64
d    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [28]:
df.info() #DataFrame 개요

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
a    6 non-null float64
b    6 non-null float64
c    6 non-null float64
d    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [29]:
df

                   a         b         c         d
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133
2013-01-02  1.685949  0.014119 -1.754792  0.917461
2013-01-03  0.475382  0.722462  0.614499  0.503905
2013-01-04 -0.923146 -0.639620  0.272507  0.277208
2013-01-05  0.708669 -1.689697  0.662005 -0.641107
2013-01-06 -0.637289  0.037247  0.987588  1.645440

In [34]:
df.sort_values(by = 'b', ascending = False)
#아래 결과에서 볼 수 있듯이, 원본 df는 대체되지 않는다.

                   a         b         c         d
2013-01-03  0.475382  0.722462  0.614499  0.503905
2013-01-06 -0.637289  0.037247  0.987588  1.645440
2013-01-02  1.685949  0.014119 -1.754792  0.917461
2013-01-04 -0.923146 -0.639620  0.272507  0.277208
2013-01-05  0.708669 -1.689697  0.662005 -0.641107
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133

In [35]:
df

                   a         b         c         d
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133
2013-01-02  1.685949  0.014119 -1.754792  0.917461
2013-01-03  0.475382  0.722462  0.614499  0.503905
2013-01-04 -0.923146 -0.639620  0.272507  0.277208
2013-01-05  0.708669 -1.689697  0.662005 -0.641107
2013-01-06 -0.637289  0.037247  0.987588  1.645440

In [38]:
#특정 column만 보고 싶을 때(Series 타입으로 출력)
df['a']

2013-01-01    0.137098
2013-01-02    1.685949
2013-01-03    0.475382
2013-01-04   -0.923146
2013-01-05    0.708669
2013-01-06   -0.637289
Freq: D, Name: a, dtype: float64

In [43]:
df[0:1]

                   a         b         c         d
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133

In [44]:
df['20130103':'20130105']

                   a         b         c         d
2013-01-03  0.475382  0.722462  0.614499  0.503905
2013-01-04 -0.923146 -0.639620  0.272507  0.277208
2013-01-05  0.708669 -1.689697  0.662005 -0.641107

In [46]:
df

                   a         b         c         d
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133
2013-01-02  1.685949  0.014119 -1.754792  0.917461
2013-01-03  0.475382  0.722462  0.614499  0.503905
2013-01-04 -0.923146 -0.639620  0.272507  0.277208
2013-01-05  0.708669 -1.689697  0.662005 -0.641107
2013-01-06 -0.637289  0.037247  0.987588  1.645440

In [45]:
df.loc[dates[0]]

a    0.137098
b   -2.049297
c   -2.244977
d   -1.473133
Name: 2013-01-01 00:00:00, dtype: float64

In [49]:
#loc: location 옵션으로 slicing
df.loc[:, ['c','b']]

                   c         b
2013-01-01 -2.244977 -2.049297
2013-01-02 -1.754792  0.014119
2013-01-03  0.614499  0.722462
2013-01-04  0.272507 -0.639620
2013-01-05  0.662005 -1.689697
2013-01-06  0.987588  0.037247

In [53]:
df.loc[dates[0]]

a    0.137098
b   -2.049297
c   -2.244977
d   -1.473133
Name: 2013-01-01 00:00:00, dtype: float64

In [55]:
df.loc[dates[0], 'b']

-2.049297243691576

In [56]:
df.loc[dates[0], ['b', 'd']]

b   -2.049297
d   -1.473133
Name: 2013-01-01 00:00:00, dtype: float64

In [50]:
df

                   a         b         c         d
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133
2013-01-02  1.685949  0.014119 -1.754792  0.917461
2013-01-03  0.475382  0.722462  0.614499  0.503905
2013-01-04 -0.923146 -0.639620  0.272507  0.277208
2013-01-05  0.708669 -1.689697  0.662005 -0.641107
2013-01-06 -0.637289  0.037247  0.987588  1.645440

In [52]:
#iloc: 행과 열의 번호로 데이터에 접근
#in R: talbe_name[1, 1]
df.iloc[0,0]

0.13709768695124536

In [57]:
df.iloc[3:5, 0:2]

                   a         b
2013-01-04 -0.923146 -0.639620
2013-01-05  0.708669 -1.689697

In [58]:
df.iloc[[1, 2], [0, 2]]

                   a         c
2013-01-02  1.685949 -1.754792
2013-01-03  0.475382  0.614499

In [59]:
df.a

2013-01-01    0.137098
2013-01-02    1.685949
2013-01-03    0.475382
2013-01-04   -0.923146
2013-01-05    0.708669
2013-01-06   -0.637289
Freq: D, Name: a, dtype: float64

In [70]:
df[df.a > 0]
#in R:
#df[df$a >0] 이런 식의 접근 불가 (undefined columns selected)
#df[df$a >0, ] 가능

                   a         b         c         d
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133
2013-01-02  1.685949  0.014119 -1.754792  0.917461
2013-01-03  0.475382  0.722462  0.614499  0.503905
2013-01-05  0.708669 -1.689697  0.662005 -0.641107

In [71]:
idx = df[df.a > 0]
#in R:

#idx <- df$a > 0 // idx가 T,F 형태로 저장. 이 후 df[idx,] 처리하면 조건에 해당되는 전체 데이터 확보
#OR df[df$a > 0,]

In [72]:
idx

                   a         b         c         d
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133
2013-01-02  1.685949  0.014119 -1.754792  0.917461
2013-01-03  0.475382  0.722462  0.614499  0.503905
2013-01-05  0.708669 -1.689697  0.662005 -0.641107

In [73]:
df[df > 0]

                   a         b         c         d
2013-01-01  0.137098       NaN       NaN       NaN
2013-01-02  1.685949  0.014119       NaN  0.917461
2013-01-03  0.475382  0.722462  0.614499  0.503905
2013-01-04       NaN       NaN  0.272507  0.277208
2013-01-05  0.708669       NaN  0.662005       NaN
2013-01-06       NaN  0.037247  0.987588  1.645440

In [75]:
#데이터 위치 아닌 내용까지 복사 .copy()
df2 = df.copy()

In [76]:
df2

                   a         b         c         d
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133
2013-01-02  1.685949  0.014119 -1.754792  0.917461
2013-01-03  0.475382  0.722462  0.614499  0.503905
2013-01-04 -0.923146 -0.639620  0.272507  0.277208
2013-01-05  0.708669 -1.689697  0.662005 -0.641107
2013-01-06 -0.637289  0.037247  0.987588  1.645440

In [79]:
df2['e'] = ['one', 'two', 'three', 'four', np.nan, 'six']

In [80]:
df2

                   a         b         c         d      e
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133    one
2013-01-02  1.685949  0.014119 -1.754792  0.917461    two
2013-01-03  0.475382  0.722462  0.614499  0.503905  three
2013-01-04 -0.923146 -0.639620  0.272507  0.277208   four
2013-01-05  0.708669 -1.689697  0.662005 -0.641107    NaN
2013-01-06 -0.637289  0.037247  0.987588  1.645440    six

In [81]:
df2['f'] = 'insta'

In [82]:
df2

                   a         b         c         d      e      f
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133    one  insta
2013-01-02  1.685949  0.014119 -1.754792  0.917461    two  insta
2013-01-03  0.475382  0.722462  0.614499  0.503905  three  insta
2013-01-04 -0.923146 -0.639620  0.272507  0.277208   four  insta
2013-01-05  0.708669 -1.689697  0.662005 -0.641107    NaN  insta
2013-01-06 -0.637289  0.037247  0.987588  1.645440    six  insta

In [87]:
df2['e'].isin('two') #체크하고자 하는 사항을 리스트화

TypeError: only list-like objects are allowed to be passed to isin(), you passed a [str]

In [92]:
df2.isin(['two'])

                a      b      c      d      e      f
2013-01-01  False  False  False  False  False  False
2013-01-02  False  False  False  False   True  False
2013-01-03  False  False  False  False  False  False
2013-01-04  False  False  False  False  False  False
2013-01-05  False  False  False  False  False  False
2013-01-06  False  False  False  False  False  False

In [93]:
df2.isin(['two', 'four'])

                a      b      c      d      e      f
2013-01-01  False  False  False  False  False  False
2013-01-02  False  False  False  False   True  False
2013-01-03  False  False  False  False  False  False
2013-01-04  False  False  False  False   True  False
2013-01-05  False  False  False  False  False  False
2013-01-06  False  False  False  False  False  False

In [90]:
df2['e'].isin(['two'])

2013-01-01    False
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05    False
2013-01-06    False
Freq: D, Name: e, dtype: bool

In [91]:
df2[df2['e'].isin(['two', 'four'])]
#in R:
#test[test$Species == 'setosa',]
#test[test$Species == 'setosa' | test$Species == 'versicolor',]

                   a         b         c         d     e      f
2013-01-02  1.685949  0.014119 -1.754792  0.917461   two  insta
2013-01-04 -0.923146 -0.639620  0.272507  0.277208  four  insta

In [95]:
df2.apply(np.cumsum) #integer 아닌 것 자동으로 처리 안한다.

TypeError: ('must be str, not float', 'occurred at index e')

In [97]:
df

                   a         b         c         d
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133
2013-01-02  1.685949  0.014119 -1.754792  0.917461
2013-01-03  0.475382  0.722462  0.614499  0.503905
2013-01-04 -0.923146 -0.639620  0.272507  0.277208
2013-01-05  0.708669 -1.689697  0.662005 -0.641107
2013-01-06 -0.637289  0.037247  0.987588  1.645440

In [96]:
df.apply(np.cumsum, axis = 1)

                   a         b         c         d
2013-01-01  0.137098 -1.912200 -4.157177 -5.630310
2013-01-02  1.685949  1.700068 -0.054725  0.862736
2013-01-03  0.475382  1.197844  1.812343  2.316248
2013-01-04 -0.923146 -1.562766 -1.290259 -1.013051
2013-01-05  0.708669 -0.981028 -0.319023 -0.960130
2013-01-06 -0.637289 -0.600042  0.387545  2.032985

In [99]:
df.apply(np.cumsum)

                   a         b         c         d
2013-01-01  0.137098 -2.049297 -2.244977 -1.473133
2013-01-02  1.823046 -2.035178 -3.999770 -0.555672
2013-01-03  2.298428 -1.312716 -3.385270 -0.051768
2013-01-04  1.375282 -1.952336 -3.112763  0.225440
2013-01-05  2.083951 -3.642033 -2.450758 -0.415667
2013-01-06  1.446662 -3.604785 -1.463171  1.229773

In [100]:
df.apply(lambda x: x.max() - x.min())

a    2.609095
b    2.771759
c    3.232565
d    3.118573
dtype: float64

In [101]:
df.apply(lambda x: x.max() - x.min(), axis = 1)

2013-01-01    2.382075
2013-01-02    3.440741
2013-01-03    0.247081
2013-01-04    1.200354
2013-01-05    2.398366
2013-01-06    2.282729
Freq: D, dtype: float64

----

In [102]:
df1 = pd.DataFrame({'A': ['a0', 'a1', 'a2', 'a3'],
                   'B': ['b0', 'b1', 'b2', 'b3'],
                   'C': ['c0', 'c1', 'c2', 'c3'],
                   'D': ['d0', 'd1', 'd2', 'd3']}, index = [0, 1, 2, 3])

In [103]:
df1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [113]:
df2 = pd.DataFrame({'A': ['a4', 'a5', 'a6', 'a7'],
                   'B': ['b4', 'b5', 'b6', 'b7'],
                   'C': ['c4', 'c5', 'c6', 'c7'],
                   'D': ['d4', 'd5', 'd6', 'd7']}, index = [4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['a8', 'a9', 'a10', 'a11'],
                   'B': ['b8', 'b9', 'b10', 'b11'],
                   'C': ['c8', 'c9', 'c10', 'c11'],
                   'D': ['d8', 'd9', 'd10', 'd11']}, index = [8, 9, 10, 11])

In [114]:
#pd.concat: 데이터 프레임들을 열방향으로 합치기
result = pd.concat([df1, df2, df3])

In [115]:
result

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [116]:
#keys 옵션으로 다중 index가 되어서 level 형성
result = pd.concat([df1, df2, df3], keys = ['x', 'y', 'z'])

In [117]:
result

        A    B    C    D
x 0    a0   b0   c0   d0
  1    a1   b1   c1   d1
  2    a2   b2   c2   d2
  3    a3   b3   c3   d3
y 4    a4   b4   c4   d4
  5    a5   b5   c5   d5
  6    a6   b6   c6   d6
  7    a7   b7   c7   d7
z 8    a8   b8   c8   d8
  9    a9   b9   c9   d9
  10  a10  b10  c10  d10
  11  a11  b11  c11  d11

In [118]:
result.index

MultiIndex(levels=[['x', 'y', 'z'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]],
           labels=[[0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]])

In [124]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [125]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [126]:
df4 = pd.DataFrame({'B': ['b2', 'b3', 'b6', 'b7'],
                   'D': ['d2', 'd3', 'd6', 'd7'],
                   'F': ['F2', 'F3', 'F6', 'F7']}, index = [2, 3, 6, 7])

In [127]:
df1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [128]:
df4

    B   D   F
2  b2  d2  F2
3  b3  d3  F3
6  b6  d6  F6
7  b7  d7  F7

In [131]:
result = pd.concat([df1, df4])

In [132]:
result

     A   B    C   D    F
0   a0  b0   c0  d0  NaN
1   a1  b1   c1  d1  NaN
2   a2  b2   c2  d2  NaN
3   a3  b3   c3  d3  NaN
2  NaN  b2  NaN  d2   F2
3  NaN  b3  NaN  d3   F3
6  NaN  b6  NaN  d6   F6
7  NaN  b7  NaN  d7   F7

In [134]:
result1 = pd.concat([df1, df4], axis = 1)

In [135]:
result1

     A    B    C    D    B    D    F
0   a0   b0   c0   d0  NaN  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN  NaN
2   a2   b2   c2   d2   b2   d2   F2
3   a3   b3   c3   d3   b3   d3   F3
6  NaN  NaN  NaN  NaN   b6   d6   F6
7  NaN  NaN  NaN  NaN   b7   d7   F7

지금까지 concat만으로 full outer join 구현

In [136]:
result = pd.concat([df1, df4], axis = 1, join = 'inner')

In [137]:
result

    A   B   C   D   B   D   F
2  a2  b2  c2  d2  b2  d2  F2
3  a3  b3  c3  d3  b3  d3  F3

In [149]:
result = pd.concat([df1, df4], join = 'inner')

In [139]:
result

    B   D
0  b0  d0
1  b1  d1
2  b2  d2
3  b3  d3
2  b2  d2
3  b3  d3
6  b6  d6
7  b7  d7

In [142]:
#위와는 다르게, ignore_index = True 옵션으로 새 index 생성
result = pd.concat([df1, df4], join = 'inner', ignore_index = True)

In [143]:
result

    B   D
0  b0  d0
1  b1  d1
2  b2  d2
3  b3  d3
4  b2  d2
5  b3  d3
6  b6  d6
7  b7  d7

In [144]:
left = pd.DataFrame({'key': ['k0', 'k4', 'k3', 'k2'],
                    'A': ['a0', 'a1', 'a2', 'a3'],
                    'B': ['b0', 'b1', 'b2', 'b3']})
right = pd.DataFrame({'key': ['k0', 'k1', 'k2', 'k3'],
                     'C': ['c0', 'c1', 'c2', 'c3'],
                     'D': ['d0', 'd1', 'd2', 'd3']})

In [145]:
left

    A   B key
0  a0  b0  k0
1  a1  b1  k4
2  a2  b2  k3
3  a3  b3  k2

In [146]:
right

    C   D key
0  c0  d0  k0
1  c1  d1  k1
2  c2  d2  k2
3  c3  d3  k3

In [148]:
#inner join on col 지정
pd.merge(left, right, on = 'key')

    A   B key   C   D
0  a0  b0  k0  c0  d0
1  a2  b2  k3  c3  d3
2  a3  b3  k2  c2  d2

In [150]:
select * from county A inner join countrycode B on A.name = B.name   
pd.merge(left, right)

    A   B key   C   D
0  a0  b0  k0  c0  d0
1  a2  b2  k3  c3  d3
2  a3  b3  k2  c2  d2

In [153]:
#left outer join
pd.merge(left, right, how = 'left', on = 'key')

    A   B key    C    D
0  a0  b0  k0   c0   d0
1  a1  b1  k4  NaN  NaN
2  a2  b2  k3   c3   d3
3  a3  b3  k2   c2   d2

In [154]:
#right outer join
pd.merge(left, right, how = 'right', on = 'key')

     A    B key   C   D
0   a0   b0  k0  c0  d0
1   a2   b2  k3  c3  d3
2   a3   b3  k2  c2  d2
3  NaN  NaN  k1  c1  d1

In [155]:
#full outer join
pd.merge(left, right, how = 'outer', on = 'key')

     A    B key    C    D
0   a0   b0  k0   c0   d0
1   a1   b1  k4  NaN  NaN
2   a2   b2  k3   c3   d3
3   a3   b3  k2   c2   d2
4  NaN  NaN  k1   c1   d1

In [156]:
#inner join on key
pd.merge(left, right, how = 'inner', on = 'key')

    A   B key   C   D
0  a0  b0  k0  c0  d0
1  a2  b2  k3  c3  d3
2  a3  b3  k2  c2  d2

----

## Pivot_table

In [1]:
import pandas as pd
import numpy as np

In [34]:
df = pd.read_excel('./data/02. sales-funnel.xlsx')

In [3]:
df.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [4]:
df.shape

(17, 8)

In [10]:
df.loc[df['Name'] == 'Trantow-Barrows', 'Price']

0    30000
1    10000
2     5000
Name: Price, dtype: int64

In [11]:
df.loc[df['Name'] == 'Trantow-Barrows', 'Price'].sum()

45000

In [12]:
pd.pivot_table(df, index = 'Name') #규봉: 안에 내용물들이 mean임을 유념

                               Account     Price  Quantity
Name
Barton LLC                    740150.0   35000.0  1.000000
Fritsch, Russel and Anderson  737550.0   35000.0  1.000000
Herman LLC                    141962.0   65000.0  2.000000
Jerde-Hilpert                 412290.0    5000.0  2.000000
Kassulke, Ondricka and Metz   307599.0    7000.0  3.000000
Keeling LLC                   688981.0  100000.0  5.000000
Kiehn-Spinka                  146832.0   65000.0  2.000000
Koepp Ltd                     729833.0   35000.0  2.000000
Kulas Inc                     218895.0   25000.0  1.500000
Purdy-Kunde                   163416.0   30000.0  1.000000
Stokes LLC                    239344.0    7500.0  1.000000
Trantow-Barrows               714466.0   15000.0  1.333333

In [59]:
pd.pivot_table(df, index = 'Name', aggfunc = np.sum)

                              Account   Price  Quantity
Name
Barton LLC                     740150   35000         1
Fritsch, Russel and Anderson   737550   35000         1
Herman LLC                     141962   65000         2
Jerde-Hilpert                  412290    5000         2
Kassulke, Ondricka and Metz    307599    7000         3
Keeling LLC                    688981  100000         5
Kiehn-Spinka                   146832   65000         2
Koepp Ltd                     1459666   70000         4
Kulas Inc                      437790   50000         3
Purdy-Kunde                    163416   30000         1
Stokes LLC                     478688   15000         2
Trantow-Barrows               2143398   45000         4

In [13]:
pd.pivot_table(df, index = 'Name').shape

(12, 3)

In [14]:
pd.pivot_table(df, index = ['Name', 'Rep', 'Manager'])

,,,Account,Price,Quantity
Name,Rep,Manager,,,
Barton LLC,John Smith,Debra Henley,740150.0,35000.0,1.000000
"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,737550.0,35000.0,1.000000
Herman LLC,Cedric Moss,Fred Anderson,141962.0,65000.0,2.000000
Jerde-Hilpert,John Smith,Debra Henley,412290.0,5000.0,2.000000
"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,307599.0,7000.0,3.000000
Keeling LLC,Wendy Yule,Fred Anderson,688981.0,100000.0,5.000000
Kiehn-Spinka,Daniel Hilton,Debra Henley,146832.0,65000.0,2.000000
Koepp Ltd,Wendy Yule,Fred Anderson,729833.0,35000.0,2.000000
Kulas Inc,Daniel Hilton,Debra Henley,218895.0,25000.0,1.500000
Purdy-Kunde,Cedric Moss,Fred Anderson,163416.0,30000.0,1.000000
Stokes LLC,Cedric Moss,Fred Anderson,239344.0,7500.0,1.000000
Trantow-Barrows,Craig Booker,Debra Henley,714466.0,15000.0,1.333333

In [15]:
pd.pivot_table(df, index = ['Name', 'Price'])

                                     Account  Quantity
Name                         Price
Barton LLC                   35000    740150         1
Fritsch, Russel and Anderson 35000    737550         1
Herman LLC                   65000    141962         2
Jerde-Hilpert                5000     412290         2
Kassulke, Ondricka and Metz  7000     307599         3
Keeling LLC                  100000   688981         5
Kiehn-Spinka                 65000    146832         2
Koepp Ltd                    5000     729833         2
                             65000    729833         2
Kulas Inc                    10000    218895         1
                             40000    218895         2
Purdy-Kunde                  30000    163416         1
Stokes LLC                   5000     239344         1
                             10000    239344         1
Trantow-Barrows              5000     714466         2
                             10000    714466         1
                             30000    714466         1

In [16]:
test = pd.pivot_table(df, index = ['Name', 'Price'])

In [61]:
test.groupby('Account').sum()

          Price  Quantity
Account
141962    65000         2
146832    65000         2
163416    30000         1
218895    50000         3
239344    15000         2
307599     7000         3
412290     5000         2
688981   100000         5
714466    45000         4
729833    70000         4
737550    35000         1
740150    35000         1

In [62]:
test.shape

(17, 2)

In [31]:
test.loc[test['Name'] == 'Trantow-Barrows', 'Quantity']
#.sum() 위해 고민필요
#규봉: 이런 경우, account 같은 주식별자로 pivot 후 진행해보자

KeyError: 'Name'

In [35]:
test = pd.pivot_table(df, index = 'Account')

In [37]:
test
#세부 셋팅을 하지 않는다면 원본 df 내 숫자형 데이터들만 정렬된다

            Price  Quantity
Account
141962    65000.0  2.000000
146832    65000.0  2.000000
163416    30000.0  1.000000
218895    25000.0  1.500000
239344     7500.0  1.000000
307599     7000.0  3.000000
412290     5000.0  2.000000
688981   100000.0  5.000000
714466    15000.0  1.333333
729833    35000.0  2.000000
737550    35000.0  1.000000
740150    35000.0  1.000000

In [63]:
test = pd.pivot_table(df, index = ['Account','Name', 'Product', 'Status'], values = ['Price', 'Quantity'])

In [64]:
test

                                                             Price  Quantity
Account Name                         Product     Status
141962  Herman LLC                   CPU         won         65000         2
146832  Kiehn-Spinka                 CPU         won         65000         2
163416  Purdy-Kunde                  CPU         presented   30000         1
218895  Kulas Inc                    CPU         pending     40000         2
                                     Software    presented   10000         1
239344  Stokes LLC                   Maintenance pending      5000         1
                                     Software    presented   10000         1
307599  Kassulke, Ondricka and Metz  Maintenance won          7000         3
412290  Jerde-Hilpert                Maintenance pending      5000         2
688981  Keeling LLC                  CPU         won        100000         5
714466  Trantow-Barrows              CPU         presented   30000         1
                                     Maintenance pending      5000         2
                                     Software    presented   10000         1
729833  Koepp Ltd                    CPU         declined    65000         2
                                     Monitor     presented    5000         2
737550  Fritsch, Russel and Anderson CPU         declined    35000         1
740150  Barton LLC                   CPU         declined    35000         1

In [65]:
test['Total'] = test['Price'] * test['Quantity']

In [66]:
test

                                                             Price  Quantity  \
Account Name                         Product     Status
141962  Herman LLC                   CPU         won         65000         2
146832  Kiehn-Spinka                 CPU         won         65000         2
163416  Purdy-Kunde                  CPU         presented   30000         1
218895  Kulas Inc                    CPU         pending     40000         2
                                     Software    presented   10000         1
239344  Stokes LLC                   Maintenance pending      5000         1
                                     Software    presented   10000         1
307599  Kassulke, Ondricka and Metz  Maintenance won          7000         3
412290  Jerde-Hilpert                Maintenance pending      5000         2
688981  Keeling LLC                  CPU         won        100000         5
714466  Trantow-Barrows              CPU         presented   30000         1
                                     Maintenance pending      5000         2
                                     Software    presented   10000         1
729833  Koepp Ltd                    CPU         declined    65000         2
                                     Monitor     presented    5000         2
737550  Fritsch, Russel and Anderson CPU         declined    35000         1
740150  Barton LLC                   CPU         declined    35000         1

                                                             Total
Account Name                         Product     Status
141962  Herman LLC                   CPU         won        130000
146832  Kiehn-Spinka                 CPU         won        130000
163416  Purdy-Kunde                  CPU         presented   30000
218895  Kulas Inc                    CPU         pending     80000
                                     Software    presented   10000
239344  Stokes LLC                   Maintenance pending      5000
                                     Software    presented   10000
307599  Kassulke, Ondricka and Metz  Maintenance won         21000
412290  Jerde-Hilpert                Maintenance pending     10000
688981  Keeling LLC                  CPU         won        500000
714466  Trantow-Barrows              CPU         presented   30000
                                     Maintenance pending     10000
                                     Software    presented   10000
729833  Koepp Ltd                    CPU         declined   130000
                                     Monitor     presented   10000
737550  Fritsch, Russel and Anderson CPU         declined    35000
740150  Barton LLC                   CPU         declined    35000

In [79]:
test.loc[714466] #loc is about Index!!

                                       Price  Quantity  Total
Name            Product     Status
Trantow-Barrows CPU         presented  30000         1  30000
                Maintenance pending     5000         2  10000
                Software    presented  10000         1  10000

In [78]:
test.loc[1, :]

KeyError: 'the label [1] is not in the [index]'

In [69]:
pd.pivot_table(df, index = ['Manager', 'Rep', 'Product'],
              values = ['Price', 'Quantity'],
              aggfunc = [np.sum, np.mean], fill_value = 0, margins = True)

                                              sum                   mean  \
                                            Price Quantity         Price
Manager       Rep           Product
Debra Henley  Craig Booker  CPU           65000.0      2.0  32500.000000
                            Maintenance    5000.0      2.0   5000.000000
                            Software      10000.0      1.0  10000.000000
              Daniel Hilton CPU          105000.0      4.0  52500.000000
                            Software      10000.0      1.0  10000.000000
              John Smith    CPU           35000.0      1.0  35000.000000
                            Maintenance    5000.0      2.0   5000.000000
Fred Anderson Cedric Moss   CPU           95000.0      3.0  47500.000000
                            Maintenance    5000.0      1.0   5000.000000
                            Software      10000.0      1.0  10000.000000
              Wendy Yule    CPU          165000.0      7.0  82500.000000
                            Maintenance    7000.0      3.0   7000.000000
                            Monitor        5000.0      2.0   5000.000000
All                                      522000.0     30.0  30705.882353


                                         Quantity
Manager       Rep           Product
Debra Henley  Craig Booker  CPU          1.000000
                            Maintenance  2.000000
                            Software     1.000000
              Daniel Hilton CPU          2.000000
                            Software     1.000000
              John Smith    CPU          1.000000
                            Maintenance  2.000000
Fred Anderson Cedric Moss   CPU          1.500000
                            Maintenance  1.000000
                            Software     1.000000
              Wendy Yule    CPU          3.500000
                            Maintenance  3.000000
                            Monitor      2.000000
All                                      1.764706

---

In [70]:
df

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
5,218895,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000,pending
6,218895,Kulas Inc,Daniel Hilton,Debra Henley,Software,1,10000,presented
7,412290,Jerde-Hilpert,John Smith,Debra Henley,Maintenance,2,5000,pending
8,740150,Barton LLC,John Smith,Debra Henley,CPU,1,35000,declined
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
11,239344,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000,pending
12,239344,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000,presented
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined
16,729833,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000,presented